[
  {
    "title": "One donation can save three lives",
    "description": "A single pint of donated blood can help up to three different patients in need."
  },
  {
    "title": "Blood has a short shelf life",
    "description": "Red blood cells must be used within 42 days and platelets within 5 days."
  },
  {
    "title": "Only 1 in 30 people donate",
    "description": "Despite the demand, only a small percentage of eligible donors actually donate blood."
  },
  {
    "title": "Your body replaces it quickly",
    "description": "The plasma from your donation is replaced within about 24 hours, and red cells in a few weeks."
  },
  {
    "title": "O-negative is the universal donor",
    "description": "O-negative blood can be given to any patient in an emergency, regardless of blood type."
  },
  {
    "title": "You can donate every 3 months",
    "description": "Healthy adults can safely donate whole blood every 12 weeks."
  },
  {
    "title": "Blood cannot be manufactured",
    "description": "Blood can only come from healthy human donors—there's no substitute."
  },
  {
    "title": "One car accident victim may need 100 pints",
    "description": "Severe trauma victims may require large quantities of blood transfusions to survive."
  },
  {
    "title": "Type AB is the universal plasma donor",
    "description": "People with AB blood type can donate plasma to anyone, which is vital in emergencies."
  },
  {
    "title": "A healthy diet helps your blood",
    "description": "Iron-rich foods like spinach and lentils boost hemoglobin, making you a stronger donor."
  },
  {
    "title": "You burn calories when donating",
    "description": "Donating a pint of blood can burn up to 650 calories!"
  },
  {
    "title": "Blood donations help cancer patients",
    "description": "Many cancer patients need blood transfusions during chemotherapy and recovery."
  },
  {
    "title": "Young donors are needed",
    "description": "New, younger donors are essential to ensure future blood supply remains stable."
  },
  {
    "title": "Blood makes up 7-8% of body weight",
    "description": "The average adult has about 10–12 pints of blood in their body."
  },
  {
    "title": "You get a free health check",
    "description": "Before donating, your blood pressure, hemoglobin, and pulse are checked for free."
  },
  {
    "title": "Donating is safe and painless",
    "description": "The process is performed with sterile, single-use equipment and takes only 10–15 minutes."
  },
  {
    "title": "Platelets help cancer and trauma patients",
    "description": "Platelets are essential for blood clotting and are often needed by chemotherapy patients."
  },
  {
    "title": "Summer and holidays have shortages",
    "description": "Blood donations drop during holidays and vacations, creating critical shortages."
  },
  {
    "title": "Most people are eligible",
    "description": "Most healthy individuals aged 18–65 can safely donate blood."
  },
  {
    "title": "Your donation travels fast",
    "description": "Blood donations are usually tested, processed, and sent to hospitals within 48–72 hours."
  },
  {
    "title": "Your blood type matters",
    "description": "Matching blood types ensures safe transfusions and helps the right patients."
  },
  {
    "title": "Frequent donors are heroes",
    "description": "Regular donors save countless lives over time through consistent contributions."
  },
  {
    "title": "Blood donation is rewarding",
    "description": "Many donors feel a sense of pride, knowing they helped someone in need."
  },
  {
    "title": "Donors are community lifelines",
    "description": "Local donations support nearby hospitals and neighbors in critical situations."
  },
  {
    "title": "You can donate platelets and plasma too",
    "description": "Beyond whole blood, you can donate platelets and plasma through specialized processes."
  }
]
